# Модель обнаружения объектов Ultralytics YOLOv8 с выходами P3/8–P5/32.
# есть две шкалы обнаружения: P3 - small, P4 - medium

# Параметры
nc: 80 # количество классов
scales: # модель составных масштабных констант, т.е. 'model=yolov8n.yaml' вызовет yolov8.yaml с масштабом 'n'
  # [depth, width, max_channels]: [глубина, ширина, макс кол/во каналов]
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 слоёв, 11166560 параметров, 11166544 градиентов,  28.8 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [откуда, повторения, модуль, аргументы]
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # конкатенация с базовой сетью P4
  - [-1, 3, C2f, [512]] # блок для P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # конкатенация с базовой сетью P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # конкатенация с головой P4
  - [-1, 3, C2f, [512]] # 18 (P4/16-medium)

#  - [-1, 1, Conv, [512, 3, 2]]
#  - [[-1, 9], 1, Concat, [1]] # конкатенация с головой P5
#  - [-1, 3, C2f, [1024]] # 21 (P5/32-large)

  - [[15, 18], 1, Detect, [nc]] # детекция с уровнями: (P3, P4, P5) # 15, 18, 21