# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Модель обнаружения объектов Ultralytics YOLOv8 с выходами P3/8–P5/32.
# есть три шкалы обнаружения: P3 - small, P4 - medium, P5 - large objects
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/detect

# Параметры
nc: 80 # количество классов
scales: # модель составных масштабных констант, т.е. 'model=yolov8n.yaml' вызовет yolov8.yaml с масштабом 'n'
  # [depth, width, max_channels]: [глубина, ширина, макс кол/во каналов]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 слоёв,  3157200 параметров,  3157184 градиентов,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 слоёв, 11166560 параметров, 11166544 градиентов,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 слоёв, 25902640 параметров, 25902624 градиентов,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 слоёв, 43691520 параметров, 43691504 градиентов, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 слоёв, 68229648 параметров, 68229632 градиентов, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [откуда, повторения, модуль, аргументы]
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # конкатенация с базовой сетью P4
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # конкатенация с базовой сетью P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # конкатенация с головой P4
  - [-1, 3, C2f, [512]] # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # конкатенация с головой P5
  - [-1, 3, C2f, [1024]] # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]] # детекция с уровнями: (P3, P4, P5)